app/Models/UserModel.php

    public function read($tipo_usuario){
        $query=$this->where('tipo_usuario', $tipo_usuario)
                    ->get();
---
SELECT *
FROM `usuarios`
WHERE `tipo_usuario` IS NULL